package com.example.gipu_android

data class RegionData(val data: Map<String, String>)

val regionData = RegionData(
    mapOf(
        "16000200" to "함안군",
        "16000300" to "창녕군",
        "16000400" to "고성군",
        "16000500" to "남해군",
        "16000600" to "하동군",
        "16000700" to "산청군",
        "16000800" to "함양군",
        "16000900" to "거창군",
        "16001000" to "합천군",
        "16010001" to "창원시 의창구",
        "16010004" to "창원시 마산회원구",
        "16010005" to "창원시 진해구",
        "16020000" to "진주시",
        "16030000" to "통영시",
        "16040000" to "사천시",
        "16050000" to "김해시",
        "16060000" to "밀양시",
        "16070000" to "거제시",
        "16080000" to "양산시"
    )
)